'''
Напишите программу с использованием рекурсии, 
которая выводит последовательность натуральных чисел от 1 до 100 включительно.
'''
<<<<<<< HEAD

=======
>>>>>>> fedc5ccb347a2309c7f5a4d9ba735e36ba9311bd
def from_zero(num=1):
    if num < 101:
        print(num)
        from_zero(num + 1)
    

from_zero()
